#!/bin/bash

echo "==Калькулятор индекса массы тела (ИМТ)=="

echo "Введите массу тела (в кг):"
read weight

if ! [[ "$weight" =~ ^[0-9]+([.][0-9]+)?$ ]]; then
    echo "Ошибка: Введите корректное число для массы"
    exit 1
fi

echo "Введите рост (в метрах, например 1.75):"
read height

if ! [[ "$height" =~ ^[0-9]+([.][0-9]+)?$ ]]; then
    echo "Ошибка: Введите корректное число для роста"
    exit 1
fi

if (( $(echo "$height == 0" | bc -l) )); then
    echo "Ошибка: Рост не может быть равен нулю"
    exit 1
fi

bmi=$(echo "scale=0; $weight / ($height * $height)" | bc)

echo ""
echo "================================="
echo "Ваш индекс массы тела (ИМТ): $bmi"
echo "================================="
