#!/bin/bash

echo "Поиск файлов с расширением .conf (без учета регистра) в директории /etc"
echo "========================================================================="

ls -l /etc | grep -i "\.conf"

if [ $? -eq 0 ]; then
    echo "====================================================================="
    echo "Поиск завершен. Найдены файлы с расширением .conf/.CONF)."
else
    echo "====================================================================="
    echo "Файлы с расширением .conf не найдены." >&2
fi
